10/data/attachments/e82003d27b9349e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d6f7e3ce-c392-4fac-b951-4a2e2c4aff44</nif:username>
            <nif:friendToBeAdded>Justin_hand_Actions_35668_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>